 
# Yosys synthesis script for up5bit_counter_dual_clock
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/06_21_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../../rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/21june/up5bit_counter_dual_clock/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/21june/up5bit_counter_dual_clock/./rtl/up5bit_counter_dual_clock.v 


# Technology mapping
hierarchy -top up5bit_counter_dual_clock



plugin -i synth-rs

synth_rs -post_cleanup 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 320 -max_reg 640 -max_device_dsp 0 -max_device_bram 0 -max_device_carry_length 0 -max_dsp 0 -max_bram 0 -max_carry_length 0  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v up5bit_counter_dual_clock_post_synth.v
write_blif -param up5bit_counter_dual_clock_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_up5bit_counter_dual_clock.sdc -json config.json -w wrapper_up5bit_counter_dual_clock_post_synth.v wrapper_up5bit_counter_dual_clock_post_synth.eblif -pr post_pnr_wrapper_up5bit_counter_dual_clock_post_synth.v post_pnr_wrapper_up5bit_counter_dual_clock_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_up5bit_counter_dual_clock_post_synth.v
write_blif -param fabric_up5bit_counter_dual_clock_post_synth.eblif

  