 
# Yosys synthesis script for ring_counter
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/11_30_2023_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/RS_PRIMITIVES/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_project/gemini/DV/usmanqadir/jira_repo/Jira_Testcase/EDA-2299/rtl  /nfs_project/gemini/DV/usmanqadir/jira_repo/Jira_Testcase/EDA-2299/rtl/ring_counter.v 


# Technology mapping
hierarchy -top ring_counter



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto -no_iobuf -max_lut 34848 -max_reg 69696 -max_device_dsp 154 -max_device_bram 154 -max_device_carry_length 48 -max_dsp 154 -max_bram 154 -max_carry_length 48  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v ring_counter_post_synth.v
write_blif -param ring_counter_post_synth.eblif

  