 
# Yosys/Surelog synthesis script for dual_port_rom
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top dual_port_rom -y ../../../.././rtl -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/Validation/RTL_testcases/Memory_Designs/dual_port_rom/jira/./rtl +libext+.v+.sv  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/Validation/RTL_testcases/Memory_Designs/dual_port_rom/jira/./rtl/dual_port_rom.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/01_26_2024_18_30_44/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top dual_port_rom



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf   -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v dual_port_rom_post_synth.v
write_blif -param dual_port_rom_post_synth.eblif

  