 
# Yosys synthesis script for test
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/10_02_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/12SEPT/Validation/RTL_testcases/Benchmarking_QoR_testcases/stereovision2/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/12SEPT/Validation/RTL_testcases/Benchmarking_QoR_testcases/stereovision2/./rtl/test.v 


# Technology mapping
hierarchy -top test



plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v test_post_synth.v
write_blif -param test_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_test.sdc -json config.json -w wrapper_test_post_synth.v wrapper_test_post_synth.eblif -pr post_pnr_wrapper_test_post_synth.v post_pnr_wrapper_test_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_test_post_synth.v
write_blif -param fabric_test_post_synth.eblif

  