 
# Yosys/Surelog synthesis script for on_chip_memory
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top on_chip_memory -I../../../../ -I/nfs_home/iparapid/mijaz/Raptor_Projects/synth_test/run_1/IPs/rapidsilicon/ip/on_chip_memory/v1_0/on_chip_memory/synth/./rtl   /nfs_home/iparapid/mijaz/Raptor_Projects/synth_test/run_1/IPs/rapidsilicon/ip/on_chip_memory/v1_0/on_chip_memory/synth/./rtl/on_chip_memory_v1_0.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/04_01_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top on_chip_memory



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v on_chip_memory_post_synth.v
write_blif -param on_chip_memory_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_on_chip_memory.sdc -json config.json -w wrapper_on_chip_memory_post_synth.v wrapper_on_chip_memory_post_synth.eblif -pr post_pnr_wrapper_on_chip_memory_post_synth.v post_pnr_wrapper_on_chip_memory_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_on_chip_memory_post_synth.v
write_blif -param fabric_on_chip_memory_post_synth.eblif

  