read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/04_05_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src ../../../.././axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src/axi_dma_rd.v
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src ../../../.././axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src/priority_encoder.v
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src ../../../.././axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src/arbiter.v
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src ../../../.././axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src/axi_dma_wr.v
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src ../../../.././axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src/axi_dma.v
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src ../../../.././axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src/axi_dma_desc_mux.v
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/4apr/Validation/RTL_testcases/IP_Catalog_Designs/axi_dma_default/EDA-2682/./axi_dma_wrapper/run_1/IPs/rapidsilicon/ip/axi_dma/v1_0/axi_dma_wrapper/src/axi_dma_wrapper_v1_0.v 

analyze -top axi_dma_wrapper
