 
# Yosys synthesis script for ram_true_reg_addr_dp_1024x32_verilator
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_11_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2492/ram_true_reg_addr_dp_1024x32_verilator/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2492/ram_true_reg_addr_dp_1024x32_verilator/./rtl/ram_true_reg_addr_dp_1024x32_verilator.v 


# Technology mapping
hierarchy -top ram_true_reg_addr_dp_1024x32_verilator



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf  -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v ram_true_reg_addr_dp_1024x32_verilator_post_synth.v
write_blif -param ram_true_reg_addr_dp_1024x32_verilator_post_synth.eblif

  