 
# Yosys synthesis script for asym_ram_sdp_wide_sync_read
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/03_05_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/5th-march/EDA-2567/asym_ram_sdp_wide_sync_read/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/5th-march/EDA-2567/asym_ram_sdp_wide_sync_read/results_dir/.././rtl/asym_ram_sdp_wide_sync_read.v 


# Technology mapping
hierarchy -top asym_ram_sdp_wide_sync_read



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf  -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v asym_ram_sdp_wide_sync_read_post_synth.v
write_blif -param asym_ram_sdp_wide_sync_read_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_asym_ram_sdp_wide_sync_read.sdc -json config.json -w wrapper_asym_ram_sdp_wide_sync_read_post_synth.v wrapper_asym_ram_sdp_wide_sync_read_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_asym_ram_sdp_wide_sync_read_post_synth.v
write_blif -param fabric_asym_ram_sdp_wide_sync_read_post_synth.eblif

  