 
# Yosys synthesis script for ram_simple_dp_synch_undefined_collision_1024x32
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_29_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/1NEW/1111111111111111/Validation/RTL_testcases/Memory_Designs/ram_simple_dp_synch_undefined_collision_1024x32/EDA-2901/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/1NEW/1111111111111111/Validation/RTL_testcases/Memory_Designs/ram_simple_dp_synch_undefined_collision_1024x32/EDA-2901/./rtl/ram_simple_dp_synch_undefined_collision_1024x32.v 


# Technology mapping
hierarchy -top ram_simple_dp_synch_undefined_collision_1024x32



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v ram_simple_dp_synch_undefined_collision_1024x32_post_synth.v
write_blif -param ram_simple_dp_synch_undefined_collision_1024x32_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_ram_simple_dp_synch_undefined_collision_1024x32.sdc -json config.json -w wrapper_ram_simple_dp_synch_undefined_collision_1024x32_post_synth.v wrapper_ram_simple_dp_synch_undefined_collision_1024x32_post_synth.eblif -pr post_pnr_wrapper_ram_simple_dp_synch_undefined_collision_1024x32_post_synth.v post_pnr_wrapper_ram_simple_dp_synch_undefined_collision_1024x32_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_ram_simple_dp_synch_undefined_collision_1024x32_post_synth.v
write_blif -param fabric_ram_simple_dp_synch_undefined_collision_1024x32_post_synth.eblif

  