 
# Yosys synthesis script for O_SERDES_primitive_inst
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/01_25_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/AE/saad/New_primitives_test_cases/Compiler_Validation_10Jan_24/Compiler_Validation/RTL_testcases/RS_FPGA_PRIMITIVES_new/New_O_serdes_testcase/O_SERDES_primitive_inst/results_dir/.././rtl  /nfs_scratch/scratch/AE/saad/New_primitives_test_cases/Compiler_Validation_10Jan_24/Compiler_Validation/RTL_testcases/RS_FPGA_PRIMITIVES_new/New_O_serdes_testcase/O_SERDES_primitive_inst/results_dir/.././rtl/O_SERDES_primitive_inst.v 


# Technology mapping
hierarchy -top O_SERDES_primitive_inst

setattr -set keep 1 w:\CLK_IN
setattr -set keep 1 w:\PLL_CLK


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf    -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v O_SERDES_primitive_inst_post_synth.v
write_blif -param O_SERDES_primitive_inst_post_synth.eblif

  