read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_15_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2500/accum_20lsb_input_to_mulltiplier_dsp19x2/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2500/accum_20lsb_input_to_mulltiplier_dsp19x2/results_dir/.././rtl/accum_20lsb_input_to_mulltiplier_dsp19x2.v 

analyze -top accum_20lsb_input_to_mulltiplier_dsp19x2
