 
# Yosys/Surelog synthesis script for mealy_fsm
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top mealy_fsm -I/home/rapidsilicon/FPGA_Course_Shawn_Hymel/introduction-to-fpga/05-finite-state-machines/example-02-mealy-fsm   /home/rapidsilicon/FPGA_Course_Shawn_Hymel/introduction-to-fpga/05-finite-state-machines/example-02-mealy-fsm/mealy-fsm.v \
/home/rapidsilicon/Aug_2024_Bash/RC1/Raptor/2024.09/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top mealy_fsm



plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal mixed   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v EDA-2924_post_synth.v
write_blif -param EDA-2924_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_EDA-2924.sdc -json config.json -w wrapper_EDA-2924_post_synth.v wrapper_EDA-2924_post_synth.eblif -pr post_pnr_wrapper_EDA-2924_post_synth.v post_pnr_wrapper_EDA-2924_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_EDA-2924_post_synth.v
write_blif -param fabric_EDA-2924_post_synth.eblif

  