 
# Yosys synthesis script for complex_multiplier
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/10_22_2023_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Compiler_Validation/RTL_testcases/DSP_Designs/complex_multiplier/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Compiler_Validation/RTL_testcases/DSP_Designs/complex_multiplier/results_dir/.././rtl/complex_multiplier.v 


# Technology mapping
hierarchy -top complex_multiplier



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v complex_multiplier_post_synth.v
write_blif -param complex_multiplier_post_synth.eblif

  