 
# Yosys synthesis script for accumulator
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/10_11_2023_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/blif_fifo_tb/Compiler_Validation/RTL_testcases/DSP_Designs/accumulator/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/blif_fifo_tb/Compiler_Validation/RTL_testcases/DSP_Designs/accumulator/results_dir/.././rtl/accumulator.v 


# Technology mapping
hierarchy -top accumulator



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf -max_lut 25600 -max_reg 51200 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v accumulator_post_synth.v
write_blif -param accumulator_post_synth.eblif

  