 
# Yosys synthesis script for tdp_256x10
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/12_06_2023_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/RS_PRIMITIVES/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Compiler_Validation/RTL_testcases/Memory_Designs/tdp_256x10/EDA-2326/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Compiler_Validation/RTL_testcases/Memory_Designs/tdp_256x10/EDA-2326/./rtl/tdp_256x10.v 


# Technology mapping
hierarchy -top tdp_256x10



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v tdp_256x10_post_synth.v
write_blif -param tdp_256x10_post_synth.eblif

  