 
# Yosys synthesis script for ram_true_dp_dc_32768x4
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/03_26_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/25march/ram_true_dp_dc_32768x4/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/25march/ram_true_dp_dc_32768x4/./rtl/ram_true_dp_dc_32768x4.v 


# Technology mapping
hierarchy -top ram_true_dp_dc_32768x4

setattr -set keep 1 w:\clkA
setattr -set keep 1 w:\clkB


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v ram_true_dp_dc_32768x4_post_synth.v
write_blif -param ram_true_dp_dc_32768x4_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_ram_true_dp_dc_32768x4.sdc -json config.json -w wrapper_ram_true_dp_dc_32768x4_post_synth.v wrapper_ram_true_dp_dc_32768x4_post_synth.eblif -pr post_pnr_wrapper_ram_true_dp_dc_32768x4_post_synth.v post_pnr_wrapper_ram_true_dp_dc_32768x4_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_ram_true_dp_dc_32768x4_post_synth.v
write_blif -param fabric_ram_true_dp_dc_32768x4_post_synth.eblif

  