create_clock -period 2.5 $auto$clkbufmap.cc:298:execute$8113 
set_input_delay 0 -clock $auto$clkbufmap.cc:298:execute$8113 [get_ports {*}] 
set_output_delay 0 -clock $auto$clkbufmap.cc:298:execute$8113 [get_ports {*}] 
set_clock_uncertainty 0.298 
