 
# Yosys synthesis script for accum_20lsb_input_to_mulltiplier_dsp19x2
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_15_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2500/accum_20lsb_input_to_mulltiplier_dsp19x2/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2500/accum_20lsb_input_to_mulltiplier_dsp19x2/results_dir/.././rtl/accum_20lsb_input_to_mulltiplier_dsp19x2.v 


# Technology mapping
hierarchy -top accum_20lsb_input_to_mulltiplier_dsp19x2



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf  -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v accum_20lsb_input_to_mulltiplier_dsp19x2_post_synth.v
write_blif -param accum_20lsb_input_to_mulltiplier_dsp19x2_post_synth.eblif

  