 
# Yosys/Surelog synthesis script for ahb2ram
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top ahb2ram -I../../../../ -I/nfs_project/gemini/DV/usmanqadir/jira_repo/Jira_Testcase/EDA-2116/ahb2ram  -sv /nfs_project/gemini/DV/usmanqadir/jira_repo/Jira_Testcase/EDA-2116/ahb2ram/ahb2ram.sv \
/nfs_eda_sw/softwares/Raptor/instl_dir/09_29_2023_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v

# Technology mapping
hierarchy -top ahb2ram



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto -no_iobuf -max_lut 34848 -max_reg 69696 -max_device_dsp 154 -max_device_bram 154 -max_device_carry_length 336 -max_dsp 154 -max_bram 154 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v ahb2ram_post_synth.v
write_blif -param ahb2ram_post_synth.eblif

  