 
# Yosys/Ghdl synthesis script for HD_ADPCM_Codec
# Read source files
plugin -i ghdl
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/10_17_2023_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
plugin -i ghdl
ghdl -frelaxed-rules --no-formal -fsynopsys -fexplicit --PREFIX=/nfs_eda_sw/softwares/Raptor/instl_dir/10_17_2023_09_15_01/bin/HDL_simulator/GHDL/lib/ghdl -P/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/test3/Compiler_Validation/RTL_testcases/VHDL_designs/audio/jira/./rtl --std=93 /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/test3/Compiler_Validation/RTL_testcases/VHDL_designs/audio/jira/./rtl/HD_ADPCM_Codec.vhd  -e 


# Technology mapping
hierarchy -top HD_ADPCM_Codec



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v HD_ADPCM_Codec_post_synth.v
write_blif -param HD_ADPCM_Codec_post_synth.eblif

  