create_clock -period 5 $auto$clkbufmap.cc:298:execute$1487 
set_input_delay 1 -clock $auto$clkbufmap.cc:298:execute$1487 [get_ports {*}] 
set_output_delay 1 -clock $auto$clkbufmap.cc:298:execute$1487 [get_ports {*}] 
