 
# Yosys synthesis script for mult_28x20_unsigned_regout
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/04_27_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/DSP_Designs/mult_28x20_unsigned_regout/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/DSP_Designs/mult_28x20_unsigned_regout/results_dir/.././rtl/mult_28x20_unsigned_regout.v 


# Technology mapping
hierarchy -top mult_28x20_unsigned_regout



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v mult_28x20_unsigned_regout_post_synth.v
write_blif -param mult_28x20_unsigned_regout_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_mult_28x20_unsigned_regout.sdc -json config.json -w wrapper_mult_28x20_unsigned_regout_post_synth.v wrapper_mult_28x20_unsigned_regout_post_synth.eblif -pr post_pnr_wrapper_mult_28x20_unsigned_regout_post_synth.v post_pnr_wrapper_mult_28x20_unsigned_regout_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_mult_28x20_unsigned_regout_post_synth.v
write_blif -param fabric_mult_28x20_unsigned_regout_post_synth.eblif

  