read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_03_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spi.svh 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/clk_gate_beh.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/pulse_sync.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_intf.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_reg.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_reg_top.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_top.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spimavb.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/levelsync.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/asyncfifo.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo_mem1r1w.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo_ram.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo_reg.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/rst_regen_low.sv 

analyze -top spim_top
