 
# Yosys synthesis script for primitive_example_design_3
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_09_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/primitive_example_design_3/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/primitive_example_design_3/results_dir/.././rtl/primitive_example_design_3.v 


# Technology mapping
hierarchy -top primitive_example_design_3



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v primitive_example_design_3_post_synth.v
write_blif -param primitive_example_design_3_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_primitive_example_design_3.sdc -json config.json -w wrapper_primitive_example_design_3_post_synth.v wrapper_primitive_example_design_3_post_synth.eblif -pr post_pnr_wrapper_primitive_example_design_3_post_synth.v post_pnr_wrapper_primitive_example_design_3_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_primitive_example_design_3_post_synth.v
write_blif -param fabric_primitive_example_design_3_post_synth.eblif

  