 
# Yosys/Surelog synthesis script for asym_ram_sdp_write_wider_dc_logic
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top asym_ram_sdp_write_wider_dc_logic -y ../../../../.././rtl -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/asym_ram_sdp_write_wider_dc_logic/results_dir/.././rtl +libext+.v+.sv  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/asym_ram_sdp_write_wider_dc_logic/results_dir/.././rtl/asym_ram_sdp_write_wider_dc_logic.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/04_30_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top asym_ram_sdp_write_wider_dc_logic



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v asym_ram_sdp_write_wider_dc_logic_post_synth.v
write_blif -param asym_ram_sdp_write_wider_dc_logic_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_asym_ram_sdp_write_wider_dc_logic.sdc -json config.json -w wrapper_asym_ram_sdp_write_wider_dc_logic_post_synth.v wrapper_asym_ram_sdp_write_wider_dc_logic_post_synth.eblif -pr post_pnr_wrapper_asym_ram_sdp_write_wider_dc_logic_post_synth.v post_pnr_wrapper_asym_ram_sdp_write_wider_dc_logic_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_asym_ram_sdp_write_wider_dc_logic_post_synth.v
write_blif -param fabric_asym_ram_sdp_write_wider_dc_logic_post_synth.eblif

  