 
# Yosys/Surelog synthesis script for add_output_of_four_multipliers
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top add_output_of_four_multipliers -y ../../../.././rtl -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/8thJuly/Validation/RTL_testcases/DSP_Designs/add_output_of_four_multipliers/EDA-3052/./rtl +libext+.v+.sv  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/8thJuly/Validation/RTL_testcases/DSP_Designs/add_output_of_four_multipliers/EDA-3052/./rtl/add_output_of_four_multipliers.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/07_11_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top add_output_of_four_multipliers



plugin -i synth-rs

synth_rs -post_cleanup 1 -new_iobuf_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v add_output_of_four_multipliers_post_synth.v
write_blif -param add_output_of_four_multipliers_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_add_output_of_four_multipliers.sdc -json config.json -w wrapper_add_output_of_four_multipliers_post_synth.v wrapper_add_output_of_four_multipliers_post_synth.eblif -pr post_pnr_wrapper_add_output_of_four_multipliers_post_synth.v post_pnr_wrapper_add_output_of_four_multipliers_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_add_output_of_four_multipliers_post_synth.v
write_blif -param fabric_add_output_of_four_multipliers_post_synth.eblif

  