 
# Yosys synthesis script for I2CLog
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/06_06_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/i2clog/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/i2clog/results_dir/.././rtl/I2C_TrafficLogger.v 


# Technology mapping
hierarchy -top I2CLog

setattr -set keep 1 w:\Clk


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v i2clog_post_synth.v
write_blif -param i2clog_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_i2clog.sdc -json config.json -w wrapper_i2clog_post_synth.v wrapper_i2clog_post_synth.eblif -pr post_pnr_wrapper_i2clog_post_synth.v post_pnr_wrapper_i2clog_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_i2clog_post_synth.v
write_blif -param fabric_i2clog_post_synth.eblif

  