read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_23_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Validation/RTL_testcases/DSP_Instantiation_19x2/add_shifted_a_to_mult_output_coeff1_input_registered_dsp19x2/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Validation/RTL_testcases/DSP_Instantiation_19x2/add_shifted_a_to_mult_output_coeff1_input_registered_dsp19x2/results_dir/.././rtl/add_shifted_a_to_mult_output_coeff1_input_registered_dsp19x2.v 

analyze -top add_shifted_a_to_mult_output_coeff1_input_registered_dsp19x2
