 
# Yosys/Surelog synthesis script for adder_tree
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top adder_tree -y ../../../.././rtl -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/adder_tree/jira/./rtl +libext+.v+.sv -sv /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/adder_tree/jira/./rtl/adder_tree.sv \
/nfs_eda_sw/softwares/Raptor/instl_dir/08_31_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top adder_tree



plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v adder_tree_post_synth.v
write_blif -param adder_tree_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_adder_tree.sdc -json config.json -w wrapper_adder_tree_post_synth.v wrapper_adder_tree_post_synth.eblif -pr post_pnr_wrapper_adder_tree_post_synth.v post_pnr_wrapper_adder_tree_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_adder_tree_post_synth.v
write_blif -param fabric_adder_tree_post_synth.eblif

  