create_clock -period 10 $auto$rs_design_edit.cc:472:add_wire_btw_prims$489 
set_input_delay 3 -clock $auto$rs_design_edit.cc:472:add_wire_btw_prims$489 [get_ports data_i] 
set_input_delay 2 -clock $auto$rs_design_edit.cc:472:add_wire_btw_prims$489 [get_ports $auto$rs_design_edit.cc:472:add_wire_btw_prims$487] 
set_input_delay 2 -clock $auto$rs_design_edit.cc:472:add_wire_btw_prims$489 [get_ports $auto$rs_design_edit.cc:472:add_wire_btw_prims$488] 
set_output_delay 3 -clock $auto$rs_design_edit.cc:472:add_wire_btw_prims$489 [get_ports $auto$rs_design_edit.cc:1187:execute$494.data_o_buf] 
