 
# Yosys/Surelog synthesis script for streamScaler_sr_top
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top streamScaler_sr_top -I/nfs_home/bphilofsky/Raptor/Scripts -I/nfs_home/bphilofsky/Raptor/Test_Designs/Github/Video_stream_Scaler/./Src   /nfs_home/bphilofsky/Raptor/Test_Designs/Github/Video_stream_Scaler/./Src/scaler.v \
/nfs_home/bphilofsky/Raptor/Test_Designs/Github/Video_stream_Scaler/./Src/scaler_sr_top.v \
/nfs_home/bphilofsky/Raptor/Raptor_2023.10/Raptor/2023.10/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v

# Technology mapping
hierarchy -top streamScaler_sr_top

setattr -set keep 1 w:\clk


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto -no_iobuf -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v Video_stream_Scaler_raptor_project_default_1GE100-ES1_post_synth.v
write_blif -param Video_stream_Scaler_raptor_project_default_1GE100-ES1_post_synth.eblif

  