read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_29_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/1NEW/1111111111111111/Validation/RTL_testcases/Memory_Designs/ram_simple_dp_synch_undefined_collision_1024x32/EDA-2901/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/1NEW/1111111111111111/Validation/RTL_testcases/Memory_Designs/ram_simple_dp_synch_undefined_collision_1024x32/EDA-2901/./rtl/ram_simple_dp_synch_undefined_collision_1024x32.v 

analyze -top ram_simple_dp_synch_undefined_collision_1024x32
