read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/11_10_2023_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_defines.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_apb_mux.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_arbiter.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_axim_cmd.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_axim_rd.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_axim_rdata.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_axim_resp.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_axim_timeout.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_axim_wdata.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_axim_wr.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_calc.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_calc_addr.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_calc_joint.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_calc_size.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_empty.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_fifo.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_fifo_ctrl.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_fifo_ptr.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_offsets.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_outs.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_periph_mux.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_rd_slicer.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_ch_reg_params.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_reg.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_reg_size.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_remain.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ch_wr_slicer.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_channels.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_channels_apb_mux.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_channels_mux.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_ctrl.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_top.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_core0_wdt.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_dual_core.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_reg_params.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_reg.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_reg_core0.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_delay.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_demux8.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_fifo.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_joint_stall.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_min2.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_min3.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_mux8.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_or8.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_rawstat.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_scatter8_1.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_stall.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_swap_32.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/prgen_swap_64.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2180/DMA_AXI_raptor_project_default_1GE100-ES1_error/./Src/dma_axi64_sr.v 

analyze -top dma_axi64_sr
