 
# Yosys synthesis script for rams_reg_io_sp_dc_16384x8
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_01_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Validation/RTL_testcases/Memory_Designs/rams_reg_io_sp_dc_16384x8/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Validation/RTL_testcases/Memory_Designs/rams_reg_io_sp_dc_16384x8/./rtl/rams_reg_io_sp_dc_16384x8.v 


# Technology mapping
hierarchy -top rams_reg_io_sp_dc_16384x8



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf   -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v rams_reg_io_sp_dc_16384x8_post_synth.v
write_blif -param rams_reg_io_sp_dc_16384x8_post_synth.eblif

  