 
# Yosys/Ghdl synthesis script for MDCT
# Read source files
plugin -i ghdl
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/03_20_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
plugin -i ghdl
ghdl -frelaxed-rules --no-formal -fsynopsys -fexplicit --PREFIX=/nfs_eda_sw/softwares/Raptor/instl_dir/03_20_2024_09_15_01/bin/HDL_simulator/GHDL/lib/ghdl -P/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl --std=08 /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/MDCT_PKG.vhd /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/DCT1D.vhd /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/DCT2D.VHD /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/ROMO.VHD /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/ROME.VHD /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/RAM.VHD /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/DBUFCTL.VHD /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/ArchBench/Testcases/mdct/mdct_golden/../rtl/MDCT.VHD  -e 


# Technology mapping
hierarchy -top MDCT



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v mdct_post_synth.v
write_blif -param mdct_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_mdct.sdc -json config.json -w wrapper_mdct_post_synth.v wrapper_mdct_post_synth.eblif -pr post_pnr_wrapper_mdct_post_synth.v post_pnr_wrapper_mdct_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_mdct_post_synth.v
write_blif -param fabric_mdct_post_synth.eblif

  