 
# Yosys synthesis script for picosoc_symbiflow
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_09_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl/simpleuart.v 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl/progmem.v 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl/picosoc_noflash.v 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl/picorv32.v 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/picosoc_no_bram/results_dir/.././rtl/picosoc_symbiflow.v 


# Technology mapping
hierarchy -top picosoc_symbiflow

setattr -set keep 1 w:\clk


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf  -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 0 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v picosoc_symbiflow_post_synth.v
write_blif -param picosoc_symbiflow_post_synth.eblif

  