 
# Yosys/Surelog synthesis script for matmul
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top matmul -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/opensource_with_testbench/Matrix-Multiplication-Using-Systolic-Arrays/./rtl   /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/opensource_with_testbench/Matrix-Multiplication-Using-Systolic-Arrays/./rtl/apb_slave.v \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/opensource_with_testbench/Matrix-Multiplication-Using-Systolic-Arrays/./rtl/matmul_calc.v \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/opensource_with_testbench/Matrix-Multiplication-Using-Systolic-Arrays/./rtl/mem.v \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/opensource_with_testbench/Matrix-Multiplication-Using-Systolic-Arrays/./rtl/pe_module.v \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/opensource_with_testbench/Matrix-Multiplication-Using-Systolic-Arrays/./rtl/matmul.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/07_05_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top matmul



plugin -i synth-rs

synth_rs -post_cleanup 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v Matrix-Multiplication-Using-Systolic-Arrays_post_synth.v
write_blif -param Matrix-Multiplication-Using-Systolic-Arrays_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_Matrix-Multiplication-Using-Systolic-Arrays.sdc -json config.json -w wrapper_Matrix-Multiplication-Using-Systolic-Arrays_post_synth.v wrapper_Matrix-Multiplication-Using-Systolic-Arrays_post_synth.eblif -pr post_pnr_wrapper_Matrix-Multiplication-Using-Systolic-Arrays_post_synth.v post_pnr_wrapper_Matrix-Multiplication-Using-Systolic-Arrays_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_Matrix-Multiplication-Using-Systolic-Arrays_post_synth.v
write_blif -param fabric_Matrix-Multiplication-Using-Systolic-Arrays_post_synth.eblif

  