 
# Yosys/Surelog synthesis script for ahb_slave_example_simulation
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top ahb_slave_example_simulation -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl   /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/bscell.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/ff_sync.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/jtag_axi_wrap.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/jtag_to_axi_top.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/jtag_to_axi_wrapper.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/jtagreg.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/tap_top.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/ahb2axi4.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/ahb2axi4_wrapper.v \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/beh_lib.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RS_Primitive_example_designs/ahb_slave_example_simulation/results_dir/.././rtl/ahb_slave_example_simulation.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/10_03_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top ahb_slave_example_simulation

setattr -set keep 1 w:\s_ahb_aclk


plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v ahb_slave_example_simulation_post_synth.v
write_blif -param ahb_slave_example_simulation_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_ahb_slave_example_simulation.sdc -json config.json -w wrapper_ahb_slave_example_simulation_post_synth.v wrapper_ahb_slave_example_simulation_post_synth.eblif -pr post_pnr_wrapper_ahb_slave_example_simulation_post_synth.v post_pnr_wrapper_ahb_slave_example_simulation_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_ahb_slave_example_simulation_post_synth.v
write_blif -param fabric_ahb_slave_example_simulation_post_synth.eblif

  