 
# Yosys/Ghdl synthesis script for top
# Read source files
plugin -i ghdl
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_15_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
plugin -i ghdl
ghdl -frelaxed-rules --no-formal -fsynopsys -fexplicit --PREFIX=/nfs_eda_sw/softwares/Raptor/instl_dir/05_15_2024_09_15_01/bin/HDL_simulator/GHDL/lib/ghdl -P/nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl --std=08 /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/ninerowsbuffer.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/krnl2.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/kernel.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/filterV.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/FIFOLineBuffer.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/DoubleLineBuffer.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/CacheSystem3.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/CacheSystem2.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/buffer.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/wrapper.vhd /nfs_scratch/scratch/CGA/repo/2024-05-16-11-55-48_T10978R108/ArchBench/Testcases/canny_edge_detection/canny_edge_detection_golden/../rtl/top.vhd  -e 


# Technology mapping
hierarchy -top top

setattr -set keep 1 w:\clk[0]
setattr -set keep 1 w:\clock0


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v canny_edge_detector_02_24_post_synth.v
write_blif -param canny_edge_detector_02_24_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_canny_edge_detector_02_24.sdc -json config.json -w wrapper_canny_edge_detector_02_24_post_synth.v wrapper_canny_edge_detector_02_24_post_synth.eblif -pr post_pnr_wrapper_canny_edge_detector_02_24_post_synth.v post_pnr_wrapper_canny_edge_detector_02_24_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_canny_edge_detector_02_24_post_synth.v
write_blif -param fabric_canny_edge_detector_02_24_post_synth.eblif

  