read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/01_22_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/SAAD_TESTCASE/Jira_Testcase/EDA-2412/accum_20lsb_input_to_mulltiplier_new_primitive/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/SAAD_TESTCASE/Jira_Testcase/EDA-2412/accum_20lsb_input_to_mulltiplier_new_primitive/results_dir/.././rtl/accum_20lsb_input_to_mulltiplier_new_primitive.v 

analyze -top accum_20lsb_input_to_mulltiplier_new_primitive
