 
# Yosys/Surelog synthesis script for design170_60_80_top
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top design170_60_80_top -y ../../../../.././rtl -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CGA/repo/2024-05-07-06-55-48_T10886R123/Validation/RTL_testcases/verilog_random_designs/design170_60_80_top/results_dir/.././rtl +libext+.v+.sv  /nfs_scratch/scratch/CGA/repo/2024-05-07-06-55-48_T10886R123/Validation/RTL_testcases/verilog_random_designs/design170_60_80_top/results_dir/.././rtl/design170_60_80_top.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/05_04_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top design170_60_80_top



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v design170_60_80_top_post_synth.v
write_blif -param design170_60_80_top_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_design170_60_80_top.sdc -json config.json -w wrapper_design170_60_80_top_post_synth.v wrapper_design170_60_80_top_post_synth.eblif -pr post_pnr_wrapper_design170_60_80_top_post_synth.v post_pnr_wrapper_design170_60_80_top_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_design170_60_80_top_post_synth.v
write_blif -param fabric_design170_60_80_top_post_synth.eblif

  