 
# Yosys synthesis script for spim_top
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_03_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spi.svh 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/clk_gate_beh.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/pulse_sync.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_intf.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_reg.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_reg_top.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spim_top.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/spimavb.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/levelsync.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/asyncfifo.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo_mem1r1w.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo_ram.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/syncfifo_reg.sv 
read_verilog -sv -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/24apr/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/spim/results_dir/.././rtl/spim/rst_regen_low.sv 


# Technology mapping
hierarchy -top spim_top

setattr -set keep 1 w:\m_avmm_clk
setattr -set keep 1 w:\sclk_in


plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v spim_top_post_synth.v
write_blif -param spim_top_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_spim_top.sdc -json config.json -w wrapper_spim_top_post_synth.v wrapper_spim_top_post_synth.eblif -pr post_pnr_wrapper_spim_top_post_synth.v post_pnr_wrapper_spim_top_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_spim_top_post_synth.v
write_blif -param fabric_spim_top_post_synth.eblif

  