 
# Yosys synthesis script for pairing
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/07_14_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/const.v 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/cubic.v 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/fsm.v 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/pairing.v 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/pe.v 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/ram.v 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/rom.v 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/tiny_tate_bilinear_pairing/results_dir/.././rtl/tiny.v 


# Technology mapping
hierarchy -top pairing

setattr -set keep 1 w:\clk


plugin -i synth-rs

synth_rs -post_cleanup 1 -new_iobuf_map 1 -ofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v tiny_tate_bilinear_pairing_post_synth.v
write_blif -param tiny_tate_bilinear_pairing_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_tiny_tate_bilinear_pairing.sdc -json config.json -w wrapper_tiny_tate_bilinear_pairing_post_synth.v wrapper_tiny_tate_bilinear_pairing_post_synth.eblif -pr post_pnr_wrapper_tiny_tate_bilinear_pairing_post_synth.v post_pnr_wrapper_tiny_tate_bilinear_pairing_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_tiny_tate_bilinear_pairing_post_synth.v
write_blif -param fabric_tiny_tate_bilinear_pairing_post_synth.eblif

  