 
# Yosys synthesis script for up_counter_neg
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/09_29_2023_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_project/castor/DV/Azfar/Rigel/DV/subsystem_level/fabric_verif_env/src/fabric_designs/benchmarks/clb/up_counter_neg  /nfs_project/castor/DV/Azfar/Rigel/DV/subsystem_level/fabric_verif_env/src/fabric_designs/benchmarks/clb/up_counter_neg/up_counter_neg.v 


# Technology mapping
hierarchy -top up_counter_neg



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto -no_iobuf -max_lut 34848 -max_reg 69696 -max_device_dsp 154 -max_device_bram 154 -max_device_carry_length 336 -max_dsp 154 -max_bram 154 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v up_counter_neg_post_synth.v
write_blif -param up_counter_neg_post_synth.eblif

  