 
# Yosys/Ghdl synthesis script for zbt_top
# Read source files
plugin -i ghdl
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_21_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
plugin -i ghdl
ghdl -frelaxed-rules --no-formal -fsynopsys -fexplicit --PREFIX=/nfs_eda_sw/softwares/Raptor/instl_dir/02_21_2024_09_15_01/bin/HDL_simulator/GHDL/lib/ghdl -P/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/EDA-2532/./rtl --std=08 /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/EDA-2532/./rtl/zbt_top.vhd  -e 


# Technology mapping
hierarchy -top zbt_top



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf  -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v zbt_top_post_synth.v
write_blif -param zbt_top_post_synth.eblif

  