 
# Yosys synthesis script for design197_15_15_top
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/09_12_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/paritygenerator_top.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/encoder.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/full_adder_top.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/memory_cntrl.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/large_adder.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/shift_reg_top.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/d_latch_top.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/invertion.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/large_mux.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/decoder_top.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/register.v
read_verilog -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl ../../../../.././rtl/mod_n_counter.v
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/verilog_random_designs/design197_15_15_top/results_dir/.././rtl/design197_15_15_top.v 


# Technology mapping
hierarchy -top design197_15_15_top



plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v design197_15_15_top_post_synth.v
write_blif -param design197_15_15_top_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_design197_15_15_top.sdc -json config.json -w wrapper_design197_15_15_top_post_synth.v wrapper_design197_15_15_top_post_synth.eblif -pr post_pnr_wrapper_design197_15_15_top_post_synth.v post_pnr_wrapper_design197_15_15_top_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_design197_15_15_top_post_synth.v
write_blif -param fabric_design197_15_15_top_post_synth.eblif

  