 
# Yosys synthesis script for stereovision2
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/09_18_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/12SEPT/Validation/RTL_testcases/Benchmarking_QoR_testcases/stereovision2/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/12SEPT/Validation/RTL_testcases/Benchmarking_QoR_testcases/stereovision2/results_dir/.././rtl/stereovision2.v 


# Technology mapping
hierarchy -top stereovision2



plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v stereovision2_post_synth.v
write_blif -param stereovision2_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_stereovision2.sdc -json config.json -w wrapper_stereovision2_post_synth.v wrapper_stereovision2_post_synth.eblif -pr post_pnr_wrapper_stereovision2_post_synth.v post_pnr_wrapper_stereovision2_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_stereovision2_post_synth.v
write_blif -param fabric_stereovision2_post_synth.eblif

  