read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/02_08_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2462/PNR_SIM_0.9.30/ram_simple_dp_dc_512x32/results_dir/ram_simple_dp_dc_512x32/run_1/synth_1_1/impl_1_1_1/routing/Jira_Testcase/EDA-2462/PNR_SIM_0.9.30/EDA-2462/raptor_with_hex/raptor_without_hex/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Jira_Testcase/EDA-2462/PNR_SIM_0.9.30/ram_simple_dp_dc_512x32/results_dir/ram_simple_dp_dc_512x32/run_1/synth_1_1/impl_1_1_1/routing/Jira_Testcase/EDA-2462/PNR_SIM_0.9.30/EDA-2462/raptor_with_hex/raptor_without_hex/./rtl/ram_simple_dp_dc_512x32.v 

analyze -top ram_simple_dp_dc_512x32
