 
# Yosys/Surelog synthesis script for wrapper_multi_enc_decx2x4
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top wrapper_multi_enc_decx2x4 -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/multi_enc_decx2x4/results_dir/.././wrapper_rtl  -sv /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/multi_enc_decx2x4/results_dir/.././wrapper_rtl/decoder.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/multi_enc_decx2x4/results_dir/.././wrapper_rtl/encoder.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/multi_enc_decx2x4/results_dir/.././wrapper_rtl/multi_enc_decx2x4.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/multi_enc_decx2x4/results_dir/.././wrapper_rtl/topenc_decx2.sv \
/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/multi_enc_decx2x4/results_dir/.././wrapper_rtl/wrapper_multi_enc_decx2x4.sv \
/nfs_eda_sw/softwares/Raptor/instl_dir/09_19_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top wrapper_multi_enc_decx2x4

setattr -set keep 1 w:\clock


plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v wrapper_multi_enc_decx2x4_post_synth.v
write_blif -param wrapper_multi_enc_decx2x4_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_wrapper_multi_enc_decx2x4.sdc -json config.json -w wrapper_wrapper_multi_enc_decx2x4_post_synth.v wrapper_wrapper_multi_enc_decx2x4_post_synth.eblif -pr post_pnr_wrapper_wrapper_multi_enc_decx2x4_post_synth.v post_pnr_wrapper_wrapper_multi_enc_decx2x4_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_wrapper_multi_enc_decx2x4_post_synth.v
write_blif -param fabric_wrapper_multi_enc_decx2x4_post_synth.eblif

  