 
# Yosys synthesis script for GJC48
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/08_27_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/GJC-IO-Testcases/GJC48/rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os_fpga2/Validation/RTL_testcases/GJC-IO-Testcases/GJC48/rtl/GJC48.v 


# Technology mapping
hierarchy -top GJC48

setattr -set keep 1 w:\clk


plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal mixed   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v GJC48_post_synth.v
write_blif -param GJC48_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_GJC48.sdc -json config.json -w wrapper_GJC48_post_synth.v wrapper_GJC48_post_synth.eblif -pr post_pnr_wrapper_GJC48_post_synth.v post_pnr_wrapper_GJC48_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_GJC48_post_synth.v
write_blif -param fabric_GJC48_post_synth.eblif

  