read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/01_25_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc000.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc001.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc010.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc011.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc100.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc101.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc110.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc111.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/ACS.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/tbu.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/mem_8x1024.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/mem_1x1024.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/encoder.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/decoder.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/viterbi_tx_rx.v 

analyze -top viterbi_tx_rx
