 
# Yosys synthesis script for system100
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/09_27_2024_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/addersub_slt.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/branchresolve.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/components.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/data_mem_stall.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/fifo.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/hi_reg.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/ifetch_pipe.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/isa.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/lo_reg.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/logic_unit.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/lpm_counter.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/merge26lo.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/mul.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/pcadder.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/reg_file.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/shifter_perbit_pipe.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/signext16.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/system.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/system100.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/t_dpram_sclk_be.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/t_dpram_sclka.v 
read_verilog  -I../../../.././rtl -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/os-fpga/Validation/RTL_testcases/titan_benchmarks/bitonic_mesh/./rtl/t_dpram_sclkb.v 


# Technology mapping
hierarchy -top system100

setattr -set keep 1 w:\clk


plugin -i synth-rs

synth_rs -post_cleanup 1 -legalize_ram_clk_ports -new_iobuf_map 3 -iofab_map 1 -tech genesis3 -de -goal delay   -effort high -carry auto  -keep_tribuf -new_dsp19x2 -new_tdp36k -max_lut 466560 -max_reg 933120 -max_device_dsp 1584 -max_device_bram 1872 -max_device_carry_length 1728 -max_dsp 1584 -max_bram 1872 -max_carry_length 1728  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v bitonic_mesh_post_synth.v
write_blif -param bitonic_mesh_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_bitonic_mesh.sdc -json config.json -w wrapper_bitonic_mesh_post_synth.v wrapper_bitonic_mesh_post_synth.eblif -pr post_pnr_wrapper_bitonic_mesh_post_synth.v post_pnr_wrapper_bitonic_mesh_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_bitonic_mesh_post_synth.v
write_blif -param fabric_bitonic_mesh_post_synth.eblif

  