 
# Yosys/Surelog synthesis script for eh2_dec
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top eh2_dec -y ../../../.././rtl -I../../../.././rtl -I../../../../ -I/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl +libext+.v+.sv -sv /home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_def.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_lib.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_pkg.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/beh_lib.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec_csr.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec_decode_ctl.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec_gpr_ctl.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec_ib_ctl.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec_tlu_ctl.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec_tlu_top.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec_trigger.sv \
/home/alain/os-fpga/Jira_Testcase/EDA-2355/./rtl/eh2_dec.sv \
/home/alain/os-fpga/Raptor/build/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top eh2_dec



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v eh2_dec_02_24_post_synth.v
write_blif -param eh2_dec_02_24_post_synth.eblif

plugin -i design-edit
design_edit -tech genesis3 -sdc pin_location_eh2_dec_02_24.sdc -json config.json -w wrapper_eh2_dec_02_24_post_synth.v wrapper_eh2_dec_02_24_post_synth.eblif -pr post_pnr_wrapper_eh2_dec_02_24_post_synth.v post_pnr_wrapper_eh2_dec_02_24_post_synth.eblif
write_verilog -noexpr -nodec -norename -v fabric_eh2_dec_02_24_post_synth.v
write_blif -param fabric_eh2_dec_02_24_post_synth.eblif

  