 
# Yosys synthesis script for viterbi_tx_rx
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/01_25_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc000.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc001.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc010.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc011.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc100.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc101.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc110.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/bmc111.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/ACS.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/tbu.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/mem_8x1024.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/mem_1x1024.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/encoder.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/decoder.v 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/repo_changes_to_newfalg/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/viterb_encoder_and_decoder/EDA-2439/./rtl/viterbi_tx_rx.v 


# Technology mapping
hierarchy -top viterbi_tx_rx



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal mixed   -effort high -carry auto -no_iobuf    -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v viterb_encoder_and_decoder_post_synth.v
write_blif -param viterb_encoder_and_decoder_post_synth.eblif

  