read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/01_25_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/AE/saad/New_primitives_test_cases/Compiler_Validation_10Jan_24/Compiler_Validation/RTL_testcases/RS_FPGA_PRIMITIVES_new/New_O_serdes_testcase/O_SERDES_primitive_inst/results_dir/.././rtl  /nfs_scratch/scratch/AE/saad/New_primitives_test_cases/Compiler_Validation_10Jan_24/Compiler_Validation/RTL_testcases/RS_FPGA_PRIMITIVES_new/New_O_serdes_testcase/O_SERDES_primitive_inst/results_dir/.././rtl/O_SERDES_primitive_inst.v 

analyze -top O_SERDES_primitive_inst
