 
# Yosys/Surelog synthesis script for tdp_512x10
# Read source files
plugin -i systemverilog
read_systemverilog -synth  -top tdp_512x10 -y ../../../../.././rtl -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/tdp_512x10_nobram/results_dir/.././rtl +libext+.v+.sv  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/RTE_FAILURE_9-feb/tdp_512x10_nobram/results_dir/.././rtl/tdp_512x10.v \
/nfs_eda_sw/softwares/Raptor/instl_dir/02_09_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v

# Technology mapping
hierarchy -top tdp_512x10



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf  -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 0 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v tdp_512x10_post_synth.v
write_blif -param tdp_512x10_post_synth.eblif

  