 
# Yosys synthesis script for ram_true_dp_wf_1024x32
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/10_28_2023_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/Compiler_Validation/RTL_testcases/Memory_Designs/ram_true_dp_wf_1024x32/EDA-2177/./rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/Compiler_Validation/RTL_testcases/Memory_Designs/ram_true_dp_wf_1024x32/EDA-2177/./rtl/ram_true_dp_wf_1024x32.v 


# Technology mapping
hierarchy -top ram_true_dp_wf_1024x32



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay   -effort high -carry auto -no_iobuf -max_lut 45408 -max_reg 90816 -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -v ram_true_dp_wf_1024x32_post_synth.v
write_blif -param ram_true_dp_wf_1024x32_post_synth.eblif

  