read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/03_28_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl -I../../../../.. -I/nfs_scratch/scratch/CompilerValidation/abdul_hameed/28march/Validation/RTL_testcases/Memory_neg_clock_trigger_designs/rams_sp_re_we_asynch_rst_1024x32_neg/EDA-2654/results_dir/.././rtl  /nfs_scratch/scratch/CompilerValidation/abdul_hameed/28march/Validation/RTL_testcases/Memory_neg_clock_trigger_designs/rams_sp_re_we_asynch_rst_1024x32_neg/EDA-2654/results_dir/.././rtl/rams_sp_re_we_asynch_rst_1024x32_neg.v 

analyze -top rams_sp_re_we_asynch_rst_1024x32_neg
