read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/10_28_2023_09_15_02/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
verilog_defines 
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/test3/Compiler_Validation/RTL_testcases/IP_Catalog_Designs/axi_fifo_default/jira/./axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src ../../../.././axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src/axi_fifo_rd.v
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/test3/Compiler_Validation/RTL_testcases/IP_Catalog_Designs/axi_fifo_default/jira/./axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src ../../../.././axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src/axi_fifo_wr.v
read_verilog -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/test3/Compiler_Validation/RTL_testcases/IP_Catalog_Designs/axi_fifo_default/jira/./axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src ../../../.././axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src/axi_fifo.v
read_verilog  -I../../../../ -I/nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/test3/Compiler_Validation/RTL_testcases/IP_Catalog_Designs/axi_fifo_default/jira/./axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src  /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/test3/Compiler_Validation/RTL_testcases/IP_Catalog_Designs/axi_fifo_default/jira/./axi_fifo_wrapper/axi_fifo_wrapper.IPs/rapidsilicon/ip/axi_fifo/v1_0/axi_fifo_wrapper/src/axi_fifo_wrapper.v 

analyze -top axi_fifo_wrapper
