read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_04_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
verilog_defines 
read_verilog  -I../../../../.././rtl/ -I../../../../.. -I/nfs_scratch/scratch/CGA/repo/2024-05-05-22-22-48_T10878R122/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/wbif_68k/results_dir/.././rtl  /nfs_scratch/scratch/CGA/repo/2024-05-05-22-22-48_T10878R122/Validation/RTL_testcases/RTL_Benchmarks_Gap_Analysis/wbif_68k/results_dir/.././rtl/dragonball_wbmaster_top.v 

analyze -top dragonball_wbmaster_top
